geoFrame/app/controllers/chats_controller.rb

SELECT "chats".* FROM "chats"
---
  def index
    @chats = Chat.all

SELECT  "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."chat_id" = 1
---
  def show
    @chat = Chat.includes(:messages).find_by(id: params[:id])

INSERT INTO "chats" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Hello"], ["user_id", 1], ["created_at", 2016-12-13 00:17:24 UTC], ["updated_at", 2016-12-13 00:17:24 UTC]]
---
  def create
    @chat = current_user.chats.build(chat_params)
    if @chat.save